เกมทายตัวเลขเกมหนึ่งมีกติกาดังนี้ 
ในเกมนี้จะมีผู้เล่น N คน แต่ละคนจะทายตัวเลขจำนวนเต็มมาคนละ 1 ตัวเลข 
โปรแกรมจะคำนวนค่า x ซึ่งหาได้จากการนำตัวเลขของทุกคน (ทั้ง N ตัว) มาหาค่าเฉลี่ยแล้วคูณด้วย 0.8
ผู้เล่นที่ให้ตัวเลขมาใกล้เคียงกับ x มากที่สุดจะได้คะแนน 1 คะแนน  (ถ้าหากมีผู้เล่นมากกว่า 1 คนที่ให้ตัวเลขที่มีความแตกต่างกับ x เท่ากันก็จะได้คะแนนกันทุกคน)
จงเขียน Function ชื่อ updateScore() สำหรับเล่นเกมนี้ โดย Function นี้จะมีรายละเอียดดังนี้
 updateScore() จะรับ Input 3 ตัว และไม่มีการ return ค่าใด ๆ จาก Function
Input ตัวที่หนึ่ง จะเป็น Array ของจำนวนเต็ม N ตัว ซึ่งเป็นตัวเลขที่ผู้เล่นแต่ละคนทายมา
Input ตัวที่สอง จะเป็น Array ของจำนวนเต็ม N ตัว ซึ่งเป็นค่าคะแนนปัจจุบันของผู้เล่นแต่ละคน
Input ตัวที่สาม จะเป็นจำนวนเต็มซึ่งเป็นจำนวนผู้เล่น
เมื่อเรียกใช้ updateScore() หลังจากที่ Function ทำงานเสร็จ Input ตัวที่สอง (คะแนน) จะมีการเปลี่ยนค่าตาม Input ตัวที่หนึ่ง และเงื่อนไขของเกมตามที่ได้อธิบายไว้
ตัวอย่างการใช้งานที่ 1
int guess_nums[] = {-2,20,40,0};
int current_scores[] = {0,5,3,2};
updateScore(guess_nums,current_scores,4);

